InterviewPreparationEmergency.tex
% Created 2021-05-26 Wed 20:52
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[margin=1in]{geometry}
\setcounter{secnumdepth}{0}
\author{Abul Kalam Robin}
\date{\today}
\title{Interview Preparation Emergency}
\hypersetup{
 pdfauthor={Abul Kalam Robin},
 pdftitle={Interview Preparation Emergency},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.2 (Org mode 9.5)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents


\section{HTML questions}
\label{sec:org9b905b8}
\begin{enumerate}
\item What is HTML
\item What are tags
\item Do all HTML tags have an end tag?
\item What is formatting in HTML?
\item How many types of heading does an HTML contain?
\item How to create a hyperlink in HTML?
\item Which HTML tag is used to display the data in the tabular form?
\item What are some common lists that are used when designing a page?
\end{enumerate}

\section{CSS questions}
\label{sec:orge37638e}
\begin{enumerate}
\item What is CSS
\item What is the Box model in CSS?
\item Which CSS properties are a part of Box model?
\item What does float do?
\item How can you clear sides of a floating element?
\item some tricky questions in rapid fire style.
\item Are CSS rule names case sensitive?
\item Why CSS selectors mixed up with cases don't apply the styles?
\item Does margin-top or margin-bottom has effect on inline element?
\item Does padding-top or padding-bottom has effect on inline element?
\item does padding-left or padding-right or margin-left or margin-right has effect on inline element?
\item If you have a <p> element with font-size: 10rem, will the text be responsive when the user resizes / drags the browser window?
\end{enumerate}

\section{JavaScript questions}
\label{sec:org12be35f}
\begin{enumerate}
\item What is JavaScript?
\item Enumerate the differences between Java and JavaScript?
\item What are JavaScript data types?
\item How would you compare two objects in JavaScript?
\item What is the use of isNaN function?
\item As [] is true, [] == true should also be true. right?
\item How could you write a method on instance of a date which will give you next day?
\item Which is faster between JavaScript and an ASP script?
\item What is negative infinity?
\item Is it possible to break JavaScript Code into several line?
\item Which company developed JavaScript?
\item What are Undeclared and undefined variables?
\item What is global variable? How to declare global variable?
\item What is prompt box?
\item What is the working timers in JavaScript?
\item Which symbols are used to comment in JavaScript?
\item What is the difference between viewstate and sessionstate in JavaScript?
\item Does JavaScript support automatic type conversion?
\item How could you cache execution of any function?
\item What is called Variable typing in JavaScript?
\end{enumerate}
\end{document}
